
const data = {
    levels: {
        'الأولى': {
            'الإنسان والصحة': [
                "التغذية عند الانسان",
                "التحصل على الطاقة عند الانسان", 
                "الاطراح وثبات توازن الوسط الداخلي",
                "التكاثر الجنسي عند الانسان",
                "الخلية"
            ],
            'الإنسان والمحيط': [
                "التغذية عند النبات الأخضر",
                "التحصل على الطاقة عند النبات الأخضر",
                "التكاثر الجنسي عند النباتات الزهرية", 
                "الخلية النباتية"
            ]
        },
        'الثانية': {
            "الإنسان والمحيط (الوسط الحي)": [
                "خصائص الوسط الحي",
                "العلاقة القائمة بين العناصر في الوسط الحي",
                "تأثير العوامل الفيزيائية على توزع الكائنات الحية ونشاطها",
                "النظام البيئي وشروطه توازنه", 
                "دور انسان في استقرار النظام البيئي"
            ],
            "الإنسان والمحيط (توزع الكائنات الحية في اوساطها)": [
                "مظاهر تكيف النباتات مع أوساطه",
                "تنفس الحيوانات واحتلال الأوساط",
                "تأثير الانسان على التوزع الطبيعي للحيوانات",
                "العلاقة بين وسط حياة حيوان ونمط تنقله"
            ],
            "الإنسان والمحيط (التكاثر واعمار الأوساط)": [
                "أنماط التكاثر عند الحيوانات",
                "أنماط التكاثر عند النباتات", 
                "تأثير الانسان على اعمار الأوساط"
            ],
            "الإنسان والمحيط (تصنيف الكائنات الحية)": [
                "مفهوم النوع عند الكائنات الحية",
                "استخدام معايير التصنيف"
            ],
            "الإنسان والمحيط (المستحاثات)": [
                "المستحاثات وشروط الاستحاثة",
                "مكانة المستحاثات في تصور الأوساط القديمة"
            ]
        },
        'الثالثة': {
            "الإنسان والمحيط (الديناميكية الداخلية للكرة الارضية)": [
                "الزلازل",
                "أسباب الزلازل",
                "نشاط الظهرات",
                "الغوص والظواهر الجيولوجية المرتبطة به",
                "التكتونية العامة و البنية الداخلية للكرة الأرضية",
                "التكتونية في حوض البحر المتوسط",
                "الإجراءات الوقائية والتنبئية المتعلقة بالظواهر الجيولوجية"
            ],
            "الانسان والمحيط (الديناميكية الخارجية للكرة الأرضية)": [
                "البنيات الجيولوجية الكبرى وخصائصها",
                "تشكل المنظر الطبيعي وطبيعة الصخور",
                "أثر العوامل المناخية في تغير المنظر الطبيعي",
                "تطور شكل المنظر الطبيعي"
            ],
            "الانسان والمحيط (استغلال الموارد الطبيعية الباطنية)": [
                "الثروات الطبيعية الباطنية في الجزائر",
                "مميزات الموارد الطبيعية في الجزائر", 
                "استغلال الموارد الطبيعية"
            ],
            "الانسان والمحيط (التربة ثروة طبيعية هشة)": [
                "التربة وسط حي",
                "تشكل التربة",
                "حماية التربة"
            ]
        },
        'الرابعة': {
            "الانسان والصحة (التغذية عند الانسان)": [
                "تحويل الأغذية خلال الهضم",
                "امتصاص المغذيات",
                "نقل المغذيات",
                "استعمال المغذيات",
                "التوازن الغذائي"
            ],
            "الانسان والصحة (التنسيق الوظيفي في العضوية)": [
                "الارتباط التشريحي للاتصال العصبي",
                "الحركة الارادية والفعل الحركي اللاإرادي",
                "اختلال الاتصال العصبي",
                "الحواجز الطبيعية والاجسام الغريبة",
                "الاستجابة المناعية اللانوعية",
                "الاستجابة المناعية النوعية", 
                "الذات و اللاذات",
                "الاعتلالات المناعية"
            ],
            "الانسان و الصحة (انتقال الصفات الوراثية)": [
                "تشكل الامشاج والالقاح",
                "دعامة انتقال الصفات الوراثية",
                "الاختلالات الوراثية"
            ]
        }
    },
    
    activities_by_module: {
        "التغذية عند الانسان": [
            "مصدر الأغذية",
            "تركيب الأغذية (تحليل تركيب الحليب )",
            "تركيب الأغذية (تحليل تركيب أغذية اخرى )",
            "دور الأغذية في الجسم",
            "الحاجيات الغذائية للعضوية",
            "الراتب الغذائي",
            "التوازن الغذائي (عواقب سوء التغذية )",
            "وضعية تعلم ادماج الموارد"
        ],
        "التحصل على الطاقة عند الانسان": [
            "المبادلات الغازية التنفسية عند الانسان",
            "المعنى البيولوجي للتنفس",
            "القواعد الصحية للتنفس",
            "وضعية تعلم ادماج الموارد"
        ],
        "الاطراح وثبات توازن الوسط الداخلي": [
            "تعريف الاطراح عند الانسان",
            "دور أعضاء الاطراح",
            "القواعد الصحية للاطراح",
            "وضعية تعلم ادماج الموارد"
        ],
        "التكاثر الجنسي عند الانسان": [
            "الأجهزة التكاثرية عند الانسان",
            "الالقاح وشروطه",
            "القواعد الصحية للتكاثر",
            "وضعية تعلم ادماج الموارد"
        ],
        "الخلية": [
            "مفهوم الخلية",
            "المجهر الضوئي",
            "الخلية الحيوانية"
        ],
        "التغذية عند النبات الأخضر": [
            "الحاجيات الغذائية للنبات الأخضر",
            "تأثير تركيز المحلول المعدني على نمو النبات",
            "مقر امتصاص المحلول المعدني",
            "المبادلات الغازية اليخضورية ومقرها",
            "التركيب الضوئي وشروطه",
            "أهمية التحكم في شروط التركيب الضوئي",
            "مسار النسغ الخام في النبات الأخضر",
            "دور النتح في انتقال النسغ /مصير النسغ",
            "وضعية تعلم ادماج الموارد"
        ],
        "التحصل على الطاقة عند النبات الأخضر": [
            "المبادلات الغازية التنفسية عند النبات الأخضر",
            "مقر المبادلات الغازية التنفسية عند النبات الأخضر",
            "المعنى البيولوجي للتنفس عند النبات",
            "اشكال أخرى للتحصل على الطاقة (التخمر)",
            "وضعية تعلم ادماج الموارد"
        ],
        "التكاثر الجنسي عند النباتات الزهرية": [
            "الأجهزة التكاثرية عند النبات الزهري",
            "الالقاح وشروطه",
            "وضعية تعلم ادماج الموارد"
        ],
        "الخلية النباتية": [
            "مفهوم الخلية",
            "المجهر الضوئي",
            "الخلية النباتية"
        ],
        "خصائص الوسط الحي": [
            "أعاين وسطا حيا قريبا",
            "أميز بين أوساط حية مختلفة"
        ],
        "العلاقة القائمة بين العناصر في الوسط الحي": [
            "أحدد مختلف تفاعلات بين العناصر الحية في الأوساط الحية",
            "أبين تنظيم العلاقات الغذائية في اوساط حية",
            "أمثل نظام التحلل وكيفية عمله"
        ],
        "تأثير العوامل الفيزيائية على توزع الكائنات الحية ونشاطها": [
            "أبرز العوامل المناخية المؤثرة على توزع الكائنات الحية ونشاطها",
            "أبرز العلاقة بين تغير الاضاءة وتوزع الكائنات الحية",
            "أظهر العلاقة بين توزع الكائنات الحية النباتية وخصائص التربة",
            "أتعرف على أشكال مقاومة الكائنات الحية للتغيرات الموسمية"
        ],
        "النظام البيئي وشروطه توازنه": [
            "أعرف النظام البيئي",
            "أحد شروط توازن النظام البيئي",
            "أميز بين أنواع الأنظمة البيئية -أنجز وسطا بيئيا"
        ],
        "دور انسان في استقرار النظام البيئي": [
            "أعاين بعض نشاطات الانسان ذات الأثر السلبي علي الأنظمة البيئية",
            "أبين التدخل الإيجابي للانسان للحفاظ على التوازن البيئي واستعادته",
            "ادماج كلي – حل الوضعية الانطلاقية"
        ],
        "مظاهر تكيف النباتات مع أوساطه": [
            "أظهر التحورات تحت الترابية للنباتات.",
            "أبين العلاقة بين التحورات البنيوية للمجموع الخضري وقدرة النباتات على مقاومة الجفاف."
        ],
        "تنفس الحيوانات واحتلال الأوساط": [
            "أظهر العلاقة بين أنماط التنفس عند الحيوانات وبين الأوساط التي يعيش فيه.",
            "أحدد الخصوصيات البنيوية لنمطين من أنماط التنفس"
        ],
        "تأثير الانسان على التوزع الطبيعي للحيوانات": [
            "أحلل عواقب صب المياه القذرة في الوديان",
            "أبرز الاجراءات المتخذة لضمان بقاء نوع حيواني (التونة الحمراء)"
        ],
        "العلاقة بين وسط حياة حيوان ونمط تنقله": [
            "أبين العلاقة بين أنماط تنقل الحيوانات والأوساط التي يعيش فيه",
            "أحلل بعض أنماط تنقل الحيوانات",
            "ادماج كلي للموارد – معالجة بيداغوجية"
        ],
        "أنماط التكاثر عند الحيوانات": [
            "أعرف استراتيجيات التكاثر الجنسي عند الحيوانات",
            "أميز تطور الجنين حسب نمطي التلقيح",
            "أضع علاقة بين إستراتيجية التكاثر واشكال غزو الحيوانات للأوساط"
        ],
        "أنماط التكاثر عند النباتات": [
            "أحدد مميزات إعمار وغزو الأوساط من طرف النباتات ذات الأزهار",
            "أظهرا إمكانية إعمار النباتات للأوساط دون تدخل التكاثر الجنسي"
        ],
        "تأثير الانسان على اعمار الأوساط": [
            "أتعرف على بعض ممارسات الانسان المرتبطة بتكاثر الحيوانات.",
            "أبرز ضرورة المحافظة على تنوع النباتات"
        ],
        "مفهوم النوع عند الكائنات الحية": [
            "أحدد شروط الانتماء إلى نفس النوع"
        ],
        "استخدام معايير التصنيف": [
            "أبرز أسس التنظيم في مجموعات عند الحيوانات والنباتات",
            "أستعمل معايير التصنيف داخل مجموعات فرعية حيوانية ونباتية",
            "ادماج كلي للموارد – معالجة بيداغوجية"
        ],
        "المستحاثات وشروط الاستحاثة": [
            "أتعرف على المستحاثة",
            "أظهر شروط الاستحاثة"
        ],
        "مكانة المستحاثات في تصور الأوساط القديمة": [
            "أبرز العلاقة بين المستحاثة ونوع الوسط قبل الاستحاثة",
            "حل الوضعية الانطلاقية"
        ],
        "الزلازل": [
            "مظاهر وعواقب زلزال",
            "خصائص الزلزال",
            "النشاط الزلزالي لشمال افريقيا"
        ],
        "أسباب الزلازل": [
            "الربط بين حدوث الزلزال وتشكل الجبال (الطيات والفوالق)",
            "اختبار فرضية مصدر الزلزال"
        ],
        "نشاط الظهرات": [
            "الشواهد الدالة على زحزحة القارات",
            "ابراز العلاقة بين زحزحة القارات والظهرات",
            "تفسير زحزحة القارات بنشاط الظهرات (أنماط ص تكتونية/ تيارات الحمل)"
        ],
        "الغوص والظواهر الجيولوجية المرتبطة به": [
            "بناء مفهوم الغوص (الية حركة تقارب الصفائح التكتونية)",
            "الظواهر الجيولوجية المرتبطة بالغوص (البركنة المرتبطة بالغوص /جبال الهيمالايا)"
        ],
        "التكتونية العامة و البنية الداخلية للكرة الأرضية": [
            "الاليات التفسيرية لاهم الظواهر الجيولوجية (تغير سرعة انتشار الأمواج الزلزالية)",
            "وصف البنية الداخلية للكرة الأرضية"
        ],
        "التكتونية في حوض البحر المتوسط": [
            "تفسير الظواهر الجيولوجية في حوض البحر المتوسط (سلسلة جبال الاطلس)",
            "النشاط الزلزالي والبركاني في إيطاليا"
        ],
        "الإجراءات الوقائية والتنبئية المتعلقة بالظواهر الجيولوجية": [
            "التقيد بالإجراءات الوقائية (انجاز بحث حول الاحتياطات الواجب اتخاذها)",
            "وضعية تعلم ادماج الموارد"
        ],
        "البنيات الجيولوجية الكبرى وخصائصها": [
            "تمييز المركبات الكبرى للمناظر الطبيعية",
            "تفسير اصل الاختلافات الملاحظة بين المناظر الطبيعية (مكاشف الصخور)"
        ],
        "تشكل المنظر الطبيعي وطبيعة الصخور": [
            "إحصاء أنواع الصخور المشكلة للمناظر الطبيعية في الجزائر",
            "الخواص الفيزيوكيميائية للصخور (تحديد خاصيتين فيزيوكيميائيتين)",
            "الربط بين خواص الصخور وتشكل المنظر الطبيعي"
        ],
        "أثر العوامل المناخية في تغير المنظر الطبيعي": [
            "آليات التأثير الفيزيوكيميائي للعوامل المناخية على الصخور (الماء / الرياح / الحرارة )",
            "التعرف على ملامح تغير تضاريس المنظر الطبيعي"
        ],
        "تطور شكل المنظر الطبيعي": [
            "التدخلات السلبية والايجابية للإنسان على تطور منظر طبيعي",
            "تطور منظر طبيعي عبر الزمن الجيولوجي (الى الشكل الحالي )",
            "وضعية تعلم ادماج الموارد"
        ],
        "الثروات الطبيعية الباطنية في الجزائر": [
            "التعرف على اهم الموارد الطبيعية الباطنية في الجزائر"
        ],
        "مميزات الموارد الطبيعية في الجزائر": [
            "خواص البترول ومراحل تشكله / تحديد مواضع تواجد الماء"
        ],
        "استغلال الموارد الطبيعية": [
            "كيفية استغلال الموارد الباطنية (البترول والماء )",
            "ابراز ضرورة الاستغلال العقلاني للموارد الباطنية",
            "وضعية تعلم ادماج الموارد"
        ],
        "التربة وسط حي": [
            "التعرف على التربة",
            "العلاقة بين بنية التربة ومكوناتها الحية",
            "الطابع الهش للتربة"
        ],
        "تشكل التربة": [
            "منشأ التربة",
            "مراحل تشكل التربة"
        ],
        "حماية التربة": [
            "التدخل السلبي والايجابي للإنسان على التربة الزراعية",
            "وضعية تعلم ادماج الموارد",
            "وقفة تقييمية (الفرض )"
        ],
        "تحويل الأغذية خلال الهضم": [
            "تشخيص المكتسبات (الوضعية الانطلاقية الشاملة)",
            "ابراز التحولات التي تطرا على مكونات غذاء (الخبز) في مختلف مستويات الانبوب الهضمي",
            "بناء مفهوم الهضم (التأثير النوعي للإنزيم)",
            "المعنى البيولوجي للهضم"
        ],
        "امتصاص المغذيات": [
            "مصير الأغذية المهضومة",
            "مميزات مقر امتصاص المغذيات"
        ],
        "نقل المغذيات": [
            "ابين دور الدم",
            "الفرض 1",
            "مسار نقل المغذيات والغازات"
        ],
        "استعمال المغذيات": [
            "استعمال غاز الاكسجين والمغذيات في نسيج حي",
            "تصحيح الفرض",
            "التنفس الخلوي عند خميرة الخبز",
            "دور المغذيات في الجسم"
        ],
        "التوازن الغذائي": [
            "عواقب التغذية الغير صحية (حل وضعيات ادماج لمختلف الاختلالات المتعلقة بالتغذية)",
            "حصة ادماج كلي للمقطع 01"
        ],
        "الارتباط التشريحي للاتصال العصبي": [
            "اتعرف على البنيات المتخصصة في استقبال التنبيهات",
            "اظهر الدعامة البنيوية للاتصال العصبي",
            "احدد مظهر الرسائل وطرائق انتقالها"
        ],
        "الحركة الارادية والفعل الحركي اللاإرادي": [
            "احلل حركة ارادية",
            "اميز خصوصيات الحركة اللاإرادية"
        ],
        "اختلال الاتصال العصبي": [
            "ابين تأثير مختلف المواد المخدرة وعواقبها",
            "حل الوضعية الانطلاقية (معالجة بيداغوجية)"
        ],
        "الحواجز الطبيعية والاجسام الغريبة": [
            "الحواجز الطبيعية التي تستعملها العضوية من اجل الحماية"
        ],
        "الاستجابة المناعية اللانوعية": [
            "اظهر مميزات الخط الدفاعي الثاني للعضوية"
        ],
        "الاستجابة المناعية النوعية": [
            "اشرح الية الخط الدفاعي الثالث للعضوية"
        ],
        "الذات و اللاذات": [
            "ابين قدرة العضوية على تمييز الذات عن اللاذات",
            "وقفة تقييمية"
        ],
        "الاعتلالات المناعية": [
            "اتعرف على حالة اعتلال مناعي (الحساسية)",
            "اشرح مبدا العون المناعي",
            "حصة ادماج كلي للمقطع 02"
        ],
        "تشكل الامشاج والالقاح": [
            "طرح الوضعية الانطلاقية",
            "اصف مراحل تشكل الامشاج الذكريه والانثوية",
            "احلل سلوك الصبغيات اثناء تشكل الامشاج لتعريف النمط النووي",
            "ابين دور الالقاح في ضمان استمرارية النوع"
        ],
        "دعامة انتقال الصفات الوراثية": [
            "اقارن بين صفات مجموعة من الافراد",
            "ابين مقر المعلومة الوراثية"
        ],
        "الاختلالات الوراثية": [
            "أتعرف على بعض الاختلالات الكروموزومية",
            "احدد اسباب بعض الامراض الوراثية",
            "أحدد معنى الطفرة الوراثية",
            "أبين خطورة الزواج بين ذوي الأقارب",
            "حل الوضعية الانطلاقية - معالجة بيداغوجية محتملة",
            "الفرض الاخير - تصحيح الفرض",
            "حل الوضعية الشاملة"
        ]
    },
    
    competencies_by_activity: {
        "مصدر الأغذية": ["يميز بين غذاء عضوي وغذاء معدني"],
        "تركيب الأغذية (تحليل تركيب الحليب )": ["يعرف كلاً من الغذاء المركب والغذاء الكامل"],
        "تركيب الأغذية (تحليل تركيب أغذية اخرى )": ["يصنف الأغذية المركبة حسب الغذاء البسيط السائد فيها"],
        "دور الأغذية في الجسم": ["يذكر دور الأغذية البسيطة في الجسم"],
        "الحاجيات الغذائية للعضوية": ["ينظم الأغذية حسب معايير", "يشخص أعراض نقص أو غياب بعض الأغذية"],
        "الراتب الغذائي": ["يقترح وجبة غذائية حسب الجنس، العمر، النشاط والظروف المناخية"],
        "التوازن الغذائي (عواقب سوء التغذية )": ["يربط بين أعراض مرضية ونقص غذاء محدد", "يقدم النصائح التي تخص التغذية الصحية", "يطبق أسس التغذية الصحية"],
        "المبادلات الغازية التنفسية عند الانسان": ["يذكر طبيعة المبادلات الغازية التنفسية عند الإنسان"],
        "المعنى البيولوجي للتنفس": ["يقدم تفسيراً أولياً للتنفس", "يعرف التنفس كعملية إنتاج الطاقة", "يفسر زيادة استهلاك الغذاء والأكسيجين عند زيادة الجهد العضلي", "يقدم تعريفاً للتنفس"],
        "القواعد الصحية للتنفس": ["يحدد القواعد الصحية للتنفس", "يربط بين بعض المشاكل الصحية التنفسية وبعض السلوكات السلبية", "يبرر أهمية ممارسة الرياضة للتنفس الصحي"],
        "تعريف الاطراح عند الانسان": ["يعرف الإطراح كظاهرة تؤمن للعضوية ثبات توازن الوسط الداخلي"],
        "دور أعضاء الاطراح": ["يقارن بين تركيب الدم والبول والعرق", "يبرز دور الكليتين في ثبات توازن الوسط الداخلي", "يعلل تواجد الغدد العرقية على مستوى الجلد", "يكتب البيانات على رسم أصم لبنية كل من الكلية والجلد"],
        "القواعد الصحية للاطراح": ["يحدد القواعد الصحية للإطراح", "يربط بين عارض مرضي متعلق بالإطراح ونمط التغذية", "يذكر سلوكات صحية لسلامة الإطراح"],
        "الأجهزة التكاثرية عند الانسان": ["يقارن بين مكونات الجهاز التناسلي الذكري والأنثوي لحيوان ثديي", "يحدد دور المناسل في التكاثر الجنسي"],
        "الالقاح وشروطه": ["يوضح ضرورة الإلقاح في التكاثر الجنسي", "يربط بين الإلقاح وحدوث التكاثر الجنسي", "يحدد شروط حدوث الإلقاح"],
        "القواعد الصحية للتكاثر": ["يستخرج القواعد الصحية", "يذكر طرق العدوى بالفيروس", "يذكر طرق الوقاية من السيدا", "يبرز أخطار السيدا من خلال بحث"],
        "مفهوم الخلية": ["يعرف الخلية كوحدة بناء", "يظهر الوحدة البنائية للخلية"],
        "المجهر الضوئي": ["يتقن استخدام المجهر", "يتبع خطوات الفحص المجهري", "يحضر المحاليل المناسبة للفحص", "يتعامل مع المجهر بطريقة صحيحة"],
        "الخلية الحيوانية": ["ينجز رسماً لخلية حيوانية"],
        "الحاجيات الغذائية للنبات الأخضر": ["يذكر الحاجات الغذائية للنبات الأخضر"],
        "تأثير تركيز المحلول المعدني على نمو النبات": ["يشخص عواقب نقص أو غياب عناصر معدنية", "يشخص عواقب الإفراط في عناصر معدنية"],
        "مقر امتصاص المحلول المعدني": ["يتعرف على خصائص التغذية عند النبات الأخضر"],
        "المبادلات الغازية اليخضورية ومقرها": ["يبين تجريبياً أن النبات الأخضر منتج للمادة العضوية"],
        "التركيب الضوئي وشروطه": ["يحدد شروط حدوث عملية التركيب الضوئي"],
        "أهمية التحكم في شروط التركيب الضوئي": ["يعرف النبات الأخضر كمصدر وحيد للمادة العضوية"],
        "مسار النسغ الخام في النبات الأخضر": ["ينمذج مسار النسغ في النبات الأخضر"],
        "دور النتح في انتقال النسغ /مصير النسغ": ["يربط بين النتح وانتقال النسغ", "يصف دور النتح في انتقال النسغ", "ينجز حوصلة حول مصير النسغ"],
        "المبادلات الغازية التنفسية عند النبات الأخضر": ["يحدد طبيعة ومقر المبادلات الغازية التنفسية عند النبات الأخضر"],
        "مقر المبادلات الغازية التنفسية عند النبات الأخضر": ["يظهر دور المسامات في المبادلات الغازية التنفسية عند النبات الأخضر"],
        "المعنى البيولوجي للتنفس عند النبات": ["يبرز مقر التنفس عند النبات الأخضر", "يعرف التنفس كعملية إنتاج الطاقة", "يفسر زيادة استهلاك الغذاء والأكسيجين عند زيادة النشاط الفيزيولوجي للنبات", "يقدم تعريفاً للتنفس"],
        "اشكال أخرى للتحصل على الطاقة (التخمر)": ["يعرف التخمر كنمط آخر لإنتاج الطاقة", "يعلل لجوء بعض الكائنات الحية للتخمر", "يستخرج الفرق بين التخمر والتنفس"],
        "الأجهزة التكاثرية عند النبات الزهري": ["يذكر مختلف أعضاء الجهاز التناسلي عند نبات زهري", "يحدد دور المناسل في التكاثر الجنسي"],
        "الخلية النباتية": ["ينجز رسماً لخلية نباتية"],
        "أعاين وسطا حيا قريبا": ["يميز من بين الحي واللاحي", "يصنف وسطا على أساس مكوناته"],
        "أميز بين أوساط حية مختلفة": ["يعرف الوسط الحي كوحدة حياتية مرتبطة بمدى جغرافي"],
        "أحدد مختلف تفاعلات بين العناصر الحية في الأوساط الحية": ["يحصي العلاقات الممكنة بين الكائنات الحية", "يضع علاقات بين الكائنات الحية في وسطها"],
        "أبين تنظيم العلاقات الغذائية في اوساط حية": ["يذكر عناصر السلسلة الغذائية", "يربط بين العلاقة الغذائية ومستوى الكائن في الشبكة الغذائية", "يذكر مستويات السلسلة الغذائية", "يصف انتقال المادة عبر حلقات السلسلة الغذائية"],
        "أمثل نظام التحلل وكيفية عمله": ["يربط استمرار حياة الكائنات الحية بانتقال المادة"],
        "أبرز العوامل المناخية المؤثرة على توزع الكائنات الحية ونشاطها": ["يربط بين توزع الكائنات الحية والعوامل المناخية"],
        "أبرز العلاقة بين تغير الاضاءة وتوزع الكائنات الحية": ["يصف تأثير العوامل المناخية على شدة الوظائف الحيوية للكائنات (التغذية، التنفس والتكاثر)"],
        "أظهر العلاقة بين توزع الكائنات الحية النباتية وخصائص التربة": ["يضع علاقة بين توزع كائنات حية نباتية وخصائص التربة"],
        "أتعرف على أشكال مقاومة الكائنات الحية للتغيرات الموسمية": ["يميز استراتيجيات مقاومة الكائنات الحية لتغيرات المواسم", "يعرف الحياة البطيئة", "يصف مظاهر الحياة البطيئة عند النباتات", "يصف مختلف أنماط مقاومة الحيوانات للظروف المناخية"],
        "أعرف النظام البيئي": ["يقدم تعريفاً للنظام البيئي"],
        "أحد شروط توازن النظام البيئي": ["يذكر الشروط اللازمة لاستمرار النظام البيئي", "يميز عوامل التوازن البيئي"],
        "أميز بين أنواع الأنظمة البيئية -أنجز وسطا بيئيا": ["يحصي مختلف الأنظمة البيئية", "ينصب نظاماً بيئياً ويعمل بالإجراءات المطلوبة لاستمراره"],
        "أعاين بعض نشاطات الانسان ذات الأثر السلبي علي الأنظمة البيئية": ["يذكر التدخلات الهدامة للإنسان في التوازن البيئي"],
        "أبين التدخل الإيجابي للانسان للحفاظ على التوازن البيئي واستعادته": ["يصف السلوكات البناءة لاسترجاع التوازن البيئي", "يحدد مسؤولية الإنسان في توازن النظام البيئي واستمراره"],
        "أظهر التحورات تحت الترابية للنباتات.": ["يصف مختلف التحورات المتعلقة بالمجموع الجذري"],
        "أبين العلاقة بين التحورات البنيوية للمجموع الخضري وقدرة النباتات على مقاومة الجفاف.": ["يربط بين الأوساط وتحورات الأجهزة الإعاشية للنباتات", "يصف مختلف التحورات المتعلقة بالأوراق", "يعلل مختلف تحورات الجهاز الإعاشي"],
        "أظهر العلاقة بين أنماط التنفس عند الحيوانات وبين الأوساط التي يعيش فيه.": ["يربط بين وسط حياة كائن حي حيواني وجهازه التنفسي", "يفسر احتلال الأوساط بتنوع أنماط التنفس", "يذكر الأنماط المختلفة للتنفس"],
        "أحدد الخصوصيات البنيوية لنمطين من أنماط التنفس": ["يحدد الخصوصيات البنيوية لنمطين من أنماط التنفس"],
        "أحلل عواقب صب المياه القذرة في الوديان": ["يذكر سلوكين على الأقل يؤديان لاختفاء حيوانات من أوساطها"],
        "أبرز الاجراءات المتخذة لضمان بقاء نوع حيواني (التونة الحمراء)": ["يقترح إجراءين وقائيين للمحافظة على التوزع الطبيعي للحيوانات", "يحافظ على استقرار التوزع الطبيعي للحيوانات في أوساطها"],
        "أبين العلاقة بين أنماط تنقل الحيوانات والأوساط التي يعيش فيه": ["يحدد العلاقة بين وسط حياة كائن حي حيواني ونمط تنقله", "يسمي مختلف أنماط التنقل"],
        "أحلل بعض أنماط تنقل الحيوانات": ["يحدد الخصوصيات البنيوية لنمطين من أنماط التنقل", "يصف مراحل إتمام القفز"],
        "أعرف استراتيجيات التكاثر الجنسي عند الحيوانات": ["يشرح تكيف التكاثر الجنسي عند الحيوانات لإعمار الأوساط"],
        "أميز تطور الجنين حسب نمطي التلقيح": ["يصف طريقتي الإلقاح"],
        "أضع علاقة بين إستراتيجية التكاثر واشكال غزو الحيوانات للأوساط": ["يميز مختلف أنماط التكاثر", "يميز التكاثر كوسيلة لإعمار الأوساط"],
        "أحدد مميزات إعمار وغزو الأوساط من طرف النباتات ذات الأزهار": ["يذكر مختلف وسائل غزو الأوساط من طرف النباتات", "يحصي مختلف العوامل المتدخلة لغزو وسط"],
        "أظهرا إمكانية إعمار النباتات للأوساط دون تدخل التكاثر الجنسي": ["يصف مختلف طرق التكاثر الخضري"],
        "أتعرف على بعض ممارسات الانسان المرتبطة بتكاثر الحيوانات.": ["يعلل تنظيم فترات الصيد", "يعبر عن سلوكين على الأقل لحماية الحيوانات وصغارها", "يربط بين التصرفات السليمة واستمرارية النوع"],
        "أبرز ضرورة المحافظة على تنوع النباتات": ["يساهم في المحافظة على تنوع النباتات", "يقترح ثلاث إجراءات على الأقل تساهم في المحافظة على التنوع النباتي"],
        "أحدد شروط الانتماء إلى نفس النوع": ["يقدم تعريفاً للنوع"],
        "أبرز أسس التنظيم في مجموعات عند الحيوانات والنباتات": ["يميز المبادئ الأساسية في التصنيف"],
        "أستعمل معايير التصنيف داخل مجموعات فرعية حيوانية ونباتية": ["يصنف كائنات حية", "يسمي مستويات الصنافة", "يرتب حيوانين على الأقل من كل طائفة باستعمال المعايير العلمية للتصنيف", "يرتب نباتين على الأقل باستعمال المعايير العلمية للتصنيف"],
        "أتعرف على المستحاثة": ["يقدم تعريفاً للمستحاثة"],
        "أظهر شروط الاستحاثة": ["يذكر شروط الاستحاثة"],
        "أبرز العلاقة بين المستحاثة ونوع الوسط قبل الاستحاثة": ["يربط بين المستحاثة ونوع وسط العيش قبل الاستحاثة", "يحدد مكانة المستحاثات في تصور الأوساط القديمة", "يميز المستحاثات كمدلولات للأوساط القديمة"],
        "مظاهر وعواقب زلزال": ["يحدد آثار وخصائص الزلزال", "يصف العواقب التي يخلفها الزلزال"],
        "خصائص الزلزال": ["يذكر خصائص الزلزال", "يحلل تسجيلاً زلزالياً"],
        "النشاط الزلزالي لشمال افريقيا": ["يعاين حزاماً زلزالياً على خريطة"],
        "الربط بين حدوث الزلزال وتشكل الجبال (الطيات والفوالق)": ["يضع علاقة بين حدوث الزلزال وتواجد الجبال", "يفسر التشوهات التي تظهر في مناطق التضاريس"],
        "اختبار فرضية مصدر الزلزال": ["يفسر أسباب الزلازل كنتيجة لنشاط الظهرات"],
        "الشواهد الدالة على زحزحة القارات": ["يربط بين تشكل الظهرات وتباعد القارات"],
        "ابراز العلاقة بين زحزحة القارات والظهرات": ["يربط بين تواجد الظهرات والتوزع العالمي للزلازل"],
        "تفسير زحزحة القارات بنشاط الظهرات (أنماط ص تكتونية/ تيارات الحمل)": ["يبرز دور تيارات الحمل في حركة الصفائح", "ينمذج تيارات الحمل", "يفسر حركة الصفائح بتيارات الحمل"],
        "بناء مفهوم الغوص (الية حركة تقارب الصفائح التكتونية)": ["بناء مفهوم التكتونية العامة", "يقدم تعريفاً لظاهرة الغوص", "يربط بين حدوث الزلازل العنيفة وظاهرة الغوص"],
        "الظواهر الجيولوجية المرتبطة بالغوص (البركنة المرتبطة بالغوص /جبال الهيمالايا)": ["يعرف البركنة الانفجارية", "يشرح كيفية تشكل الجبال"],
        "الاليات التفسيرية لاهم الظواهر الجيولوجية (تغير سرعة انتشار الأمواج الزلزالية)": ["يقدم نموذجاً تفسيرياً لبنية الكرة الأرضية", "يرسم مقطعاً للكرة الأرضية", "يمثل أهم التشكيلات التكتونية", "يترجم الرسم المنجز إلى نص علمي"],
        "وصف البنية الداخلية للكرة الأرضية": ["يميز أهم الصفائح التكتونية", "يذكر أنماط الصفائح التكتونية", "يقدم مثالاً عن كل نمط"],
        "تفسير الظواهر الجيولوجية في حوض البحر المتوسط (سلسلة جبال الاطلس)": ["يشرح الظواهر التكتونية لمنطقة حوض البحر الأبيض المتوسط", "يفسر توزع الزلازل على طول سلسلة الأطلس"],
        "النشاط الزلزالي والبركاني في إيطاليا": ["يربط بين النمط الانفجاري للبراكين في إيطاليا وظاهرة الغوص"],
        "التقيد بالإجراءات الوقائية (انجاز بحث حول الاحتياطات الواجب اتخاذها)": ["يميز الإجراءات الوقائية بخصوص الكوارث الناجمة عن النشاط التكتوني", "يذكر الاحتياطات الواجب اتخاذها لتفادي الخسائر البشرية والمادية عند حدوث نشاط تكتوني"],
        "تمييز المركبات الكبرى للمناظر الطبيعية": ["يميز المركبات الكبرى للمناظر الطبيعية", "يصنف مركبات المناظر المحلية"],
        "تفسير اصل الاختلافات الملاحظة بين المناظر الطبيعية (مكاشف الصخور)": ["يفسر أصل الاختلافات الملاحظة بين المناظر الطبيعية"],
        "إحصاء أنواع الصخور المشكلة للمناظر الطبيعية في الجزائر": ["يحدد خواص الصخور التي لها علاقة بعوامل المناخ"],
        "الخواص الفيزيوكيميائية للصخور (تحديد خاصيتين فيزيوكيميائيتين)": ["يحدد خاصتين فيزيوكيميائيتين للصخور"],
        "الربط بين خواص الصخور وتشكل المنظر الطبيعي": ["يربط بين خواص الصخور وتشكل منظر طبيعي"],
        "آليات التأثير الفيزيوكيميائي للعوامل المناخية على الصخور (الماء / الرياح / الحرارة )": ["يحدد فعل العوامل المناخية على تطور منظر طبيعي", "يشرح كيفية تأثير العوامل المناخية على الصخور", "يخطط تاريخ تطور غابة أو واد", "يرسم مخططاً لتطور تشكل حوض ترسيب"],
        "التعرف على ملامح تغير تضاريس المنظر الطبيعي": ["يحدد فعل العوامل المناخية على تطور منظر طبيعي"],
        "التدخلات السلبية والايجابية للإنسان على تطور منظر طبيعي": ["يحدد عواقب تدخل الإنسان على المنظر الطبيعي", "يذكر مثالين من التدخل الإيجابي للإنسان", "يذكر مثالين من التدخل السلبي للإنسان"],
        "تطور منظر طبيعي عبر الزمن الجيولوجي (الى الشكل الحالي )": ["يحدد عواقب تدخل الإنسان على المنظر الطبيعي"],
        "التعرف على اهم الموارد الطبيعية الباطنية في الجزائر": ["يحدد مميزات الموارد الباطنية", "يصنف الموارد في الجزائر"],
        "خواص البترول ومراحل تشكله / تحديد مواضع تواجد الماء": ["يذكر خواص البترول", "يصف مراحل تشكل البترول", "يحدد موضع تواجد الماء", "ينجز نموذجاً لجيب مائي"],
        "كيفية استغلال الموارد الباطنية (البترول والماء )": ["يبين كيفية استغلال الموارد الباطنية", "يسمي مراحل استغلال البترول", "يذكر كيفية استغلال الماء", "يخطط دورة الماء في الطبيعة"],
        "ابراز ضرورة الاستغلال العقلاني للموارد الباطنية": ["يشارك في حوار حول الاستغلال العقلاني للموارد الباطنية", "يبرر ضرورة الاستهلاك العقلاني للموارد الباطنية", "يبين أهمية استغلال الطاقات المتجددة"],
        "التعرف على التربة": ["يعرف التربة كوسط حي", "يسمي مكونات التربة الزراعية"],
        "العلاقة بين بنية التربة ومكوناتها الحية": ["يفسر كثافة الغطاء النباتي بتوفر الماء", "يربط بين بنية التربة وقدرتها على الاحتفاظ بالماء", "يذكر دور الكائنات الحية في التربة"],
        "الطابع الهش للتربة": ["يعرف التربة كوسط حي"],
        "منشأ التربة": ["يميز مراحل تشكل التربة", "يسمي آفاق التربة"],
        "مراحل تشكل التربة": ["يصف مراحل نشأة التربة"],
        "التدخل السلبي والايجابي للإنسان على التربة الزراعية": ["يحدد أشكال تدخل الإنسان على مستوى التربة الزراعية", "يحصي أنماط التدخل السلبي للإنسان على التربة الزراعية", "يحصي أنماط التدخل الإيجابي للإنسان على التربة الزراعية"],
        "ابراز التحولات التي تطرا على مكونات غذاء (الخبز) في مختلف مستويات الانبوب الهضمي": ["يميز مختلف التحولات التي تطرأ على الأغذية", "يذكر تحولات الغذاء على مختلف مستويات الأنبوب الهضمي"],
        "بناء مفهوم الهضم (التأثير النوعي للإنزيم)": ["يصف خطوات تجربة الهضم الاصطناعي بواسطة اللعابين للنشاء", "يبين التأثير النوعي للإنزيم", "يقدم تعريفاً للهضم"],
        "المعنى البيولوجي للهضم": ["يقدم حوصلة لنواتج الهضم", "يقدم تعريفاً للمغذيات", "ينمذج الدعامة التشريحية للهضم","يتعرف على المعنى البيولوجي للهضم"],
        "مصير الأغذية المهضومة": [ "يميز مقر الامتصاص", "يحدد مقر الامتصاص كسطح تبادل بين الدم ومحتوى المعي الدقيق"],
        "مميزات مقر امتصاص المغذيات": ["يربط بين بنية الزغابة المعوية والامتصاص المعوي", "يصف بنية الجدار الداخلي للمعي الدقيق", "يمثل برسم بنية الزغابة المعوية", "يعرف الامتصاص"],
        "ابين دور الدم": ["يحدد العناصر التي تنقل المغذيات والغازات"],
        "مسار نقل المغذيات والغازات": ["يميز طريقة انتقال الأغذية في الجسم", "يحدد مسار المغذيات", "ينمذج طريقي نقل المغذيات", "يسمي مكونات الدم","يحدد العناصر التي تنقل المغذيات والغازات"],
        "استعمال غاز الاكسجين والمغذيات في نسيج حي": ["يفسر ضرورة الإمداد المتواصل للخلية بالمغذيات", "يحدد مقر استعمال المغذيات", "يقدم تعريفاً فيزيولوجياً للتنفس"],
        "التنفس الخلوي عند خميرة الخبز" :["يحدد مقر استعمال المغذيات", "يقدم تعريفاً فيزيولوجياً للتنفس"],
        "دور المغذيات في الجسم": ["يحدد دور كل من الغلوسيدات والدسم في العضوية", "يحدد دور الأحماض الأمينية في العضوية"],
        "عواقب التغذية الغير صحية (حل وضعيات ادماج لمختلف الاختلالات المتعلقة بالتغذية)": ["يتعرف على أسس التغذية الصحية", "يقدم تعريفاً للتوازن الغذائي","يذكر على الأقل مثالين من عواقب التغذية غير الصحية"],
        "حصة ادماج كلي للمقطع 01": ["حل وضعيات ادماجية - معالجة بيداغوجية" ],
        "اتعرف على البنيات المتخصصة في استقبال التنبيهات": ["يصف بنية الجلد"],
        "اظهر الدعامة البنيوية للاتصال العصبي": ["يميز الارتباط التشريحي في الاتصال العصبي"],
        "احدد مظهر الرسائل وطرائق انتقالها": ["ينمذج الارتباط التشريحي بين مستقبل حسي ومركزه العصبي"],
        "احلل حركة ارادية": ["يحدد الأعضاء الفاعلة في حدوث فعل إرادي"],
        "اميز خصوصيات الحركة اللاإرادية": ["يميز خصوصيات الحركة الإرادية واللاإرادية", "يسمي الأعضاء الفاعلة في حدوث المنعكس الفطري", "يقارن بين الحركة الإرادية والحركة اللاإرادية"],
        "ابين تأثير مختلف المواد المخدرة وعواقبها": ["يساهم في نقاش حول التوعية ضد مخاطر المخدرات", "يذكر المواد المخدرة الأكثر شيوعاً", "يحصي عواقب تناول المخدرات"],
        "الحواجز الطبيعية التي تستعملها العضوية من اجل الحماية": ["يميز مختلف أشكال الرد المناعي", "يحدد عناصر الخط الدفاعي الأول الخارجي", "يقدم أمثلة عن الأجسام الغريبة"],
        "اظهر مميزات الخط الدفاعي الثاني للعضوية": ["يشرح مراحل الاستجابة المناعية اللانوعية"],
        "اشرح الية الخط الدفاعي الثالث للعضوية": ["يذكر مراحل الاستجابة المناعية النوعية", "ينمذج المعقد المناعي", "يصف الاستجابة المناعية الخلوية"],
        "ابين قدرة العضوية على تمييز الذات عن اللاذات": ["يميز بين الذات واللاذات", "يعرف الذات واللاذات", "يقدم مثالاً عن الذات", "يعمل الفرق بين الاستجابة الأولية والثانوية تجاه نفس الجسم الغريب"],
        "اتعرف على حالة اعتلال مناعي (الحساسية)": ["يتعرف على حالة اعتلال مناعي", "يعرف الحساسية", "يصف المظاهر الشائعة للحساسية", "يذكر ثلاثة أمثلة عن العوامل المسببة للحساسية"],
        "اشرح مبدا العون المناعي": ["يميز بين التلقيح والإستمصال", "يحدد ميزة اللقاح", "يحدد ميزة الاستمصال"],
        "اصف مراحل تشكل الامشاج الذكريه والانثوية": ["يصف مراحل تشكل الأمشاج", "يقارن بين خلية جسمية وخلية جنسية من حيث عدد الصبغيات"],
        "احلل سلوك الصبغيات اثناء تشكل الامشاج لتعريف النمط النووي": ["يفسر ضرورة الإلقاح في الحفاظ على عدد صبغيات النوع", "يعرف النمط النووي"],
        "ابين دور الالقاح في ضمان استمرارية النوع": ["يقدم تعريفاً للإلقاح"],
        "اقارن بين صفات مجموعة من الافراد": ["يحدد دور الإلقاح في ثبات عدد صبغيات النوع", "يعرف النمط الظاهري"],
        "ابين مقر المعلومة الوراثية": ["يميز النواة كحامل للدعامة الوراثية", "يصف تجربة تبرز دور النواة في انتقال الصفات الوراثية"],
        "أتعرف على بعض الاختلالات الكروموزومية": ["يفسر بعض الاختلالات الوراثية", "يربط بين إصابة الصبغي وتغير صفة وراثية", "يقدم أمثلة عن انتقال الصفة المتغيرة وراثياً"],
        "احدد اسباب بعض الامراض الوراثية": ["يميز عواقب الاختلالات الوراثية", "يقدم أمثلة عن ظهور أمراض نتيجة التعرض للإشعاعات"],
        "أبين خطورة الزواج بين ذوي الأقارب": ["يقدم أمثلة عن بعض عواقب الزواج بين ذوي القرابة", "ينشر الوعي حول مخاطر الزواج بين الأقارب", "يحدد المخاطر الصحية للزواج بين ذوي القرابة", "يقدم نصائح وقائية للحد من الأمراض الوراثية"]
    }
};
